Revit 2027 API
Element.GetExternalResourceReferencesExpanded Method
 Gets the expanded map of the external resource references referenced by the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IDictionary<ExternalResourceType, IList<ExternalResourceReference>> GetExternalResourceReferencesExpanded()
Public Function GetExternalResourceReferencesExpanded As IDictionary(Of ExternalResourceType, IList(Of ExternalResourceReference))
public:
IDictionary<ExternalResourceType^, IList<ExternalResourceReference^>^>^ GetExternalResourceReferencesExpanded()
member GetExternalResourceReferencesExpanded : unit -> IDictionary<ExternalResourceType, IList<ExternalResourceReference>>
Return Value
IDictionary<ExternalResourceType, IList<ExternalResourceReference>>
 The expanded map of the external resource references referenced by the element.
Exceptions
Exception | Condition
InvalidOperationException |  This Element does not use any external resource.
Remarks
 The value includes all external resource references under the type. Use this API for an element which has multiple external resource references under a specified type, e.g., AppearanceAssetElement. See also: [!:Autodesk::Revit::DB::Element::getExternalResourceReferences].
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace